In [14]:
arr1 = [ 5,6,7]

for i in range(len(arr1)):
    for j in range(len(arr1)-1):
        if arr1[j]>arr1[i]:
            arr1[i],arr1[j]=arr1[j],arr1[i]

In [15]:
ans = arr1[-2]
ans

6

In [5]:
import pandas as pd
data = {
    'EmployeeID':  [101, 102, 103, 104, 105],
    'Department':['HR', 'Finance', 'IT', 'HR', 'IT'],
    'Salary': [60000, 75000, 90000, 90000, 87000]
}
df = pd.DataFrame(data)
df

   EmployeeID Department  Salary
0         101         HR   60000
1         102    Finance   75000
2         103         IT   90000
3         104         HR   90000
4         105         IT   87000